""" 
Title：ABC264B-Nice Grid
URL：https://atcoder.jp/contests/abc264/tasks/abc264_b
"""

import io
import sys

# 問題のINPUTをここに入力する。
_INPUT = """\
4 5
"""
sys.stdin = io.StringIO(_INPUT)

""" 
回答はここから
 """
""" 
解法A（力技）
"""
# Gridを定義
grid = [
    '###############',
    '#.............#',
    '#.###########.#',
    '#.#.........#.#',
    '#.#.#######.#.#',
    '#.#.#.....#.#.#',
    '#.#.#.###.#.#.#',
    '#.#.#.#.#.#.#.#',
    '#.#.#.###.#.#.#',
    '#.#.#.....#.#.#',
    '#.#.#######.#.#',
    '#.#.........#.#',
    '#.###########.#',
    '#.............#',
    '###############'
]

# 標準入力から値を取得する。
R,C = map(int, input().split())
# GirdのR行C列の値が'#'の場合、'black'を出力。それ以外の場合は'white'を出力。
print('black' if grid[R-1][C-1] == '#' else 'white')

""" 
解法B チェビシェフ距離（チェス盤距離）
"""
# 中央(8,8)からの距離が奇数：黒
# 中央(8,8)からの距離が偶数：白
# →max{|R-8|,|C-8|}
print('black' if max(abs(R-8), abs(C-8)) % 2 == 1 else 'white')
